[
  {
    "name": "Ken Lovic",
    "title": "Head Coach",
    "photo": "https://gt-lax-app.web.app/coaches/images/ken_lovic.jpg",
    "bio": "Ken Lovic has Coached Georgia Tech Men's Lacrosse since 1997, achieving five SELC titles, multiple Final Four appearances, and over 300 career wins. Coach Lovic has been pivotal in elevating Georgia Tech lacrosse to national prominence."
  },
  {
    "name": "E.J. Freeman",
    "title": "Assoc. Head Coach, Offense",
    "photo": "https://gt-lax-app.web.app/coaches/images/ej_freeman.jpg",
    "bio": "E.J. Freeman has coached since 2012 and has been integral to the program's success, including multiple SELC championships. A former Denison University player and Atlanta native, Freeman also serves as the Director of Player Programs for the MCLA"
  },
  {
    "name": "Mat Edmunds",
    "title": "Asst. Head Coach, Recruiting",
    "photo": "https://gt-lax-app.web.app/coaches/images/mat_edmunds.jpg",
    "bio": "Mat Edmunds, a Lees-McRae College graduate and former All-Conference midfielder, serves as the Assistant Head Coach for Georgia Tech Men's Lacrosse. A seasoned coach with over a decade at Georgia Tech, he brings experience from collegiate coaching and international play, having won multiple European Championship gold medals with England."
  },
  {
    "name": "Jack Van Slyke",
    "title": "Defense & Goalies",
    "photo": "https://gt-lax-app.web.app/coaches/images/jack_van_slyke.jpg",
    "bio": "Jack Van Slyke, a Bucknell University graduate and former goalie, serves as a Volunteer Assistant Coach at Georgia Tech, focusing on defense and goalie development. An Atlanta native and son of Georgia Tech lacrosse alumnus Paul Van Slyke, Jack brings his collegiate playing experience to the program."
  },
  {
    "name": "Kevin Lewis",
    "title": "Asst. Defensive Coach",
    "photo": "https://gt-lax-app.web.app/coaches/images/kevin_lewis.jpg",
    "bio": "Kevin Lewis, a former Georgia Tech team captain and standout defenseman, now serves as an Assistant Defense Coach."
  }
]
  